<?php
// разрешение на кроссдоменные запросы
$input = file_get_contents("sample01.txt");

// разделитель предложений
$sep = '. ';

// разделитель для пакета вывода
$sip = '|{------------------------------------------}|';

// --------------------------------------------------------------------------
// 1 - выдача результата для объекта
//if ($what == 1)
//{
// “площею __________ кв.м., що знаходиться за адресою __________” “адресою” “площею” “адреса” “площа”
$poena1[0] = "площею";
$poena1[1] = "площа";
$poena1[2] = "за адресою";
$poena1[3] = "адреса";
$poena1[4] = "адрес";
$poena1[5] = "Адреса";
$poena1[6] = "Поверх";

// подсчёт кол-ва предложений
$howmany = substr_count($input, $sep);

// разбивка текста на предложения
$inputarray = explode($sep, $input);

// переменная для контроля отсутствия повторений
$temporoccur = 'none';

// переменная для выведения двух фрагментов адреса:
$additionalCounter = 1;

for ($i = 0; $i <= $howmany; $i++)
{
    for ($counter = 0; $counter <= 6; $counter++)
    {
        if (stristr($inputarray[$i], $poena1[$counter]) !== FALSE)
        {
            if ($temporoccur != $inputarray[$i])
            {
                echo $inputarray[$i].'. '.PHP_EOL;
                $additionalCounter = $additionalCounter+1;
                if ($additionalCounter == 2)
                {
                    break 2;
                }
                $temporoccur = $inputarray[$i];
            }
        }
    }
}
//}
echo $sip;
// --------------------------------------------------------------------------
// 2 - выдача результата для цели
//if ($what == 2)
//{
// "з метою", "для того, щоб", “призначення”, “цільове”, “цільовому”, “змінювати”, “види діяльності”, “приміщення надається для” “мета оренди”
$poena2[0] = "/з метою";
$poena2[1] = "для того, щоб";
$poena2[2] = "/призначення";
$poena2[3] = "/цільове";
$poena2[4] = "/цільовому";
$poena2[5] = "надається для";
$poena2[6] = "мета оренди";
$poena2[7] = "для здійснення";
$poena2[8] = "Орендарю для";
$poena2[9] = "використання для";
$poena2[9] = "з метою використання";


// подсчёт кол-ва предложений
$howmany = substr_count($input, $sep);

// разбивка текста на предложения
$inputarray = explode($sep, $input);

// переменная для контроля отсутствия повторений
$temporoccur = 'none';

for ($i = 0; $i <= $howmany; $i++)
{
    for ($counter = 0; $counter <= 9; $counter++)
    {
        if (stristr($inputarray[$i], $poena2[$counter]) !== FALSE)
        {
            if ($temporoccur != $inputarray[$i])
            {
                echo $inputarray[$i].'. '.PHP_EOL;
                $temporoccur = $inputarray[$i];
            }
        }
    }
}
//}
echo $sip;
// --------------------------------------------------------------------------
// 3 - выдача результата для цены
//if ($what == 3)
//{
// “Орендар сплачує” “Орендна плата сплачується” “Орендар зобов'язаний сплатити” “Орендар зобов'язується сплатити” “Орендар оплачує” “Орендар вносить орендну плату”
// “Орендну плату”, “аванс”, “становить грн на місяць”, “складає грн на місяць”, “постоплата”, “оплата за найм”, “оплата” “за рахунок”, “у розмірі”, “перераховується не пізніше”
// “збільшення орендної плати” “складає дол.”
$poena3[0] = "/Орендар сплачує";
$poena3[1] = "/орендар сплачує";
$poena3[2] = "/Орендар оплачує";
$poena3[3] = "/орендар оплачує";
$poena3[4] = "Орендна плата";
$poena3[5] = "Орендна плата";
$poena3[6] = "Орендну плату";
$poena3[7] = "Орендну плату";
$poena3[8] = "/Орендар зобов'язаний сплатити";
$poena3[9] = "/Орендар зобов'язаний сплатити";
$poena3[10] = "/Орендар зобов'язується сплатити";
$poena3[11] = "/Орендар зобов'язується сплатити";
$poena3[12] = "Орендар вносить орендну плату";
$poena3[13] = "Орендар вносить орендну плату";
$poena3[14] = "грн на місяць";
$poena3[15] = "грн. на місяць";
$poena3[16] = "грн за місяць";
$poena3[17] = "грн. за місяць";
$poena3[18] = "грн в місяць";
$poena3[19] = "грн. в місяць";
$poena3[20] = "грн у місяць";
$poena3[21] = "грн. у місяць";
$poena3[22] = "Орендар оплачує";
$poena3[23] = "Оплата цих послуг";
$poena3[24] = "Вартість";


// подсчёт кол-ва предложений
$howmany = substr_count($input, $sep);

// разбивка текста на предложения
$inputarray = explode($sep, $input);

// переменная для контроля отсутствия повторений
$temporoccur = 'none';

for ($i = 0; $i <= $howmany; $i++)
{
    for ($counter = 0; $counter <= 24; $counter++)
    {
        if (stristr($inputarray[$i], $poena3[$counter]) !== FALSE)
        {
            if ($temporoccur != $inputarray[$i])
            {
                echo $inputarray[$i].'. '.PHP_EOL;
                $temporoccur = $inputarray[$i];
            }
        }
    }
}
//}
echo $sip;
// --------------------------------------------------------------------------
// 4 - выдача результата для сроков
//if ($what == 4)
//{
// “пл
$poena4[0] = "/рік";
$poena4[1] = "/роки";
$poena4[2] = "/року";
$poena4[3] = "/місяць";
$poena4[4] = "/місяці";
$poena4[5] = "діє до";
$poena4[6] = "Строк";
$poena4[7] = "строк";

// подсчёт кол-ва предложений
$howmany = substr_count($input, $sep);

// разбивка текста на предложения
$inputarray = explode($sep, $input);

// переменная для контроля отсутствия повторений
$temporoccur = 'none';

for ($i = 0; $i <= $howmany; $i++)
{
    for ($counter = 0; $counter <= 7; $counter++)
    {
        if (stristr($inputarray[$i], $poena4[$counter]) !== FALSE)
        {
            if ($temporoccur != $inputarray[$i])
            {
                echo $inputarray[$i].'. '.PHP_EOL;
                $temporoccur = $inputarray[$i];
            }
        }
    }
}
//}
echo $sip;
// --------------------------------------------------------------------------
// 5 - выдача результата для ответственности
//if ($what == 5)
//{
$poena5[0] = "пеня";
$poena5[1] = "Пеня";
$poena5[2] = "пені";
$poena5[3] = "Пені";
$poena5[4] = "пеню";
$poena5[5] = "Пеню";
$poena5[6] = "несе відповідальн";
$poena5[7] = "штраф";

// подсчёт кол-ва предложений
$howmany = substr_count($input, $sep);

// разбивка текста на предложения
$inputarray = explode($sep, $input);

for ($i = 0; $i <= $howmany; $i++)
{
    for ($counter = 0; $counter <= 7; $counter++)
    {
        if (stristr($inputarray[$i], $poena5[$counter]) !== FALSE)
        {
            if ($temporoccur != $inputarray[$i])
            {
                echo $inputarray[$i].'. '.PHP_EOL;
                $temporoccur = $inputarray[$i];
            }
        }
    }
}
//}

?>